Tekla Open API Reference for Tekla Structures 2025
LogicalWeld.Select Method
 Selects a logical weld from the model database. The logical weld identifier must be set.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Select()
Public Overrides Function Select As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
LogicalWeld Class
Select Overload
Tekla.Structures.Model Namespace